{
  "posts": [
    {
      "id": 1,
      "dpName": "Disguised Ad",
      "image": "disguisedad.jpg",
      "dims": {
        "width": 400,
        "height": 300
      },
      "website": "https://www.softpedia.com/",
      "date": "2022-05-24",
      "type": 0,
      "description": "Un tipo di design pattern che implica l’utilizzo di giochi , pulsanti o altri elementi interattivi che l’utente trova in una pagina, che mascherano in realtà una pubblicità. In casi estremi l’intera pagina web è trasformata in un annuncio, facendo sì che l’utente in qualsiasi punto clicchi viene ridirezionato verso un’altra pagina. In questo esempio tratto dal sito softpedia.com viene mostrato un bottone di “Download Now” che in realtà rimanda ad un sito esterno, invece che effettuare il download del programma richiesto.",
      "comments": [
        {
          "id": 1,
          "user": {
            "name": "Giovanni Esposito"
          },
          "text": "Ho trovato anch'io molti siti che contengono questo tipo di dark pattern",
          "likes": 0,
          "isLiked": false
        },
        {
          "id": 2,
          "user": {
            "name": "Sabrina Afeltra"
          },
          "text": "Leggendo queste news, sto guardando molto più attentamente ogni sito che visito...per evitare di essere ingannato ",
          "likes": 4,
          "isLiked": true
        }
      ]
    },
    {
      "id": 2,
      "dpName": "Trick Questions",
      "image": "trickquestions.jpg",
      "dims": {
        "width": 400,
        "height": 100
      },
      "website": "https://www.codemasters.com/",
      "date": "2022-04-03",
      "type": 1,
      "description": "Sul sito codemasters.com viene utilizzata una doppia negazione correlata a questa checkbox per confondere l’utente ed indurlo ad iscriversi a una newsletter. Da notare la formulazione volutamente confusionaria “Non deselezionare questa casella se vuoi essere contattato tramite email...”",
      "comments": [
        {
          "id": 1,
          "user": {
            "name": "Antonio Gioia"
          },
          "text": "Mi chiedo perchè vogliono renderci tutto così complicato",
          "likes": 20,
          "isLiked": true
        },
        {
          "id": 2,
          "user": {
            "name": "Cinzia Belvedere"
          },
          "text": "Le cose semplici non sono mai piaciute a nessuno",
          "likes": 5,
          "isLiked": false
        }
      ]
    },
    {
      "id": 3,
      "dpName": "False Hierarchy",
      "image": "falsehierarchy.jpg",
      "dims": {
        "width": 300,
        "height": 270
      },
      "website": "https://www.reddit.com/",
      "date": "2022-02-13",
      "type": 1,
      "description": "È un dark pattern con il quale si cerca di convincere l’utente ad effettuare una scelta piuttosto che un’altra rendendola più appetibile con maggiori decorazioni o più interattività. In particolare si cerca di dare l’impressione che l’opzione evidenziata sia l’unica o la migliore, come sul sito reddit.com",
      "comments": [
        {
          "id": 1,
          "user": {
            "name": "Francesca Ammirati"
          },
          "text": "Some text about dark patterns",
          "likes": 13,
          "isLiked": true
        },
        {
          "id": 2,
          "user": {
            "name": "Manuela Esposito"
          },
          "text": "Some text about dark patterns with a lot of text that should go on another line and let the image still be on top of the container",
          "likes": 3,
          "isLiked": false
        }
      ]
    }
  ]
}
